# Вывести по номеру месяца количество дней в нем (без указания названия месяца, в феврале 28 дней)
# Результат проверки вывести на консоль Если номер месяца некорректен - сообщить об этом

month = {"1": "31","2": "28","3": "31","4": "30","5": "31","6": "30","7": "31","8": "31","9": "30","10": "31","11": "30","12": "31"}

user_input = input("Введите номер месяца: ")

if user_input not in month:
    print("Номер месяца введен некооректно!")

print(month[user_input])
       
